>>> 1+1  #এই এক্সপ্রেশন এভ্যালুয়েট হয়ে ২ হয়েছে, সুতরাং এটা বুলিয়ান এক্সপ্রেশন নয়!
2
 
>>> 1 == 1  # এক সমান সমান এক, কথা তো ঠিকই আছে, তাই এটা ট্রু হবে (== দুইটা সমান চিহ্ন খেয়াল করুন)
True

>>> 1 != 1  # এক সমান নয় একের! কথা ভুল! 
False       # তাই ফলস মানে মিথ্যা

>>> 1 != 2  # এক সমান নয় দুয়ের, কথা সত্য! 
True 

>>> 5 > 4   # পাঁচ বড় চারের চেয়ে, সত্য! 
True

>>> 4 > 5   # চার বড় পাঁচের চেয়ে!!! মিথ্যা! 
False

>>> 3 < 7   # তিন ছোট সাতের চেয়ে! হুম! 
True

>>> 7 < 3   # সাত ছোট তিনের চেয়ে! উঁহু ! 
False

>>> 8 >= 7  # আট বড় অথবা সমান সাতের! সত্য (কারন আট সাতের চেয়ে বড়) 
True

>>> 8 >= 8  # আট বড় অথবা সমান আটের! সত্য (কারন আট আটের সমান)
True

>>> 8 >= 9  # আট বড় অথবা সমান নয়ের! মিথ্যা (কারন আট নয়ের চেয়ে ছোট, সমান বা বড় না!)
False

>>> 6 <= 5  # ছয় ছোট অথবা সমান পাঁচের! মিথ্যা! কারন ? 
False

>>> 6 <= 6  # ছয় ছোট অথবা সমান ছয়ের! সত্য! 
True

>>> 6 <= 7  # ছয় ছোট অথবা সমান সাতের! সত্য! 
True
