>>> 1     # আপনাকে ইন্টারপ্রেটারে যোগ বিয়োগ করতেই হবে এরকম কোন কথা নেই, শুধুমাত্র একটা ভ্যালু দিয়েও এক্সপ্রেশন হয়! 
1         # একটা ভ্যালু দিলে সেটা এভ্যালুয়েট হয়ে আগের মতই থাকে, এক্সপ্রেশন এভ্যালুয়েট হয় সিঙ্গেল ভ্যালু পাওয়ার জন্য, যা এখানে আগে থেকেইই আছে!  

>>> 5+5   # যেকোন পুর্ন সংখ্যা ইন্টেজার টাইপ, ৫ একটা ইন্টেজার, ১ একটা ইন্টেজার এবং
10        # ১০ ও একটা ইন্টেজার টাইপ ভ্যালু

>>> 2.0   # শুধু পুর্ন সংখ্যা দিয়ে তো আর জীবন চলবেনা, আমাদের ভগ্নাংশেরও দরকার আছে, ভগ্নাংশ যুক্ত সংখ্যাগুলোকে বলা হয় ফ্লোটিং পয়েন্ট (floating) বা ফ্লোট (float) টাইপ
2.0       # এটাকে ফ্লোট/রিয়েল/বা ডাবলও বলা হয়... যার যেমন ইচ্ছা! 

>>> 8/2   # আপনি কি আগে খেয়াল করেছিলেন যে আট কে দুই দিয়ে ভাগ করলে 4 (ইন্টেজার) এর পরিবর্তে 4.0 (ফ্লোট) আউটপুট আসে!? 
4.0       # ইন্টেজার দিয়ে ইন্টেজারকে ভাগ করুন অথবা ফ্লোট দিয়ে ফ্লোটকে, বা ইন্টেজার দিয়ে ফ্লোটকে অথবা ফ্লোট দিয়ে ইন্টেজারকে! রেজাল্ট সব সময় ফ্লোট নামারই আসবে

>>> 8//1  # তবে আপনি যদি ভাগের রেজাল্ট ইন্টেজার নাম্বার ইসেবে চান তাহলে // অপারেটর ব্যবহার করুন, এটাকে বলে ফ্লোর ডিভিশন অপারেটর
4         # ফ্লোর ডিভিশন দিয়ে ভাগ করলে সেটার রেজাল্ট সব সময় ইন্টেজার হিসেবে আসবে, এবং ভগ্নাংশ (যদি থাকে) তাহলে সেটা বাদ দেয়া হবে

>>> "Hello World!"   #টেক্সট, হ্যা, আপনি ডাবল কোটেশনের ভিতর সাধারন যেকোন টেক্সট লিখতে পারেন, এটাকে বলে স্ট্রিং, বা স্ট্রিং টাইপ ভ্যালু
'Hello World!'       #স্ট্রিং (string) দিয়েই মুলত টেক্সট বা লেখার সব ধরনের কাজ করা হয়, এ নিয়ে পরে আমরা আরো বিস্তারিত জানব

>>> 'Hello World!'   #আপনি স্ট্রিং কে সিঙ্গেল কোট ('') অথবা ডাবল কোট ("") এর ভিতর লিখতে পারেন, একই জিনিশ! 
'Hello World'        #তবে শুরুতে ডাবলকোট দিলে শেষেও ডাবলকোট দিতে হবে, এরকম ভাবে প্রথমে সিঙ্গেল কোট দিলে শেষেও সিঙ্গেল কোট দিতে হবে

>>> True   # বুলিয়ান টাইপ! True মানে সত্য, বাস্তব, আছে ইত্যাদি। স্কুলের অংকে বুলিয়ান এলজেব্রা নিয়ে পড়েছেন নিশ্চয় !?
True       

>>> False  # বুলিয়ান ফলস, এর অর্থ হল মিথ্যা, নেই, অবাস্তব ইত্যাদি
False
