>>> input()   #এই ফাংশন কল করলে (লিখে এন্টার চাপলে) সে অপেক্ষা করতে থাকে ইউজারের কাছ থেকে কোন ভ্যালু পাওয়ার,
hello world   #যখন ইউজার কিবোর্ডে কোন কিছু লিখে এন্টার চাপে (যেমন বামের hello world লিখে এন্টার চাপলাম) তখন
'hello world' #ফাংশনটি সে ভ্যালুকে স্ট্রিং হিসেবে রিটার্ন করে, বামের মত! 

>>> first_name = input() #ইনপুট করা ভ্যালু ভ্যারিয়েবলের ভিতরও রাখা যায়, মনে রাখবেন = অপারেটরের ডান পাশ আগে এভ্যালুয়েট 
rabiul                   #হয় তারপর সেটা বাম পাশের ভ্যারিয়েবলে এসাইন হয়।
>>>               #যেহেতু input() থেকে রিটার্নকৃত ভ্যালুটি ভ্যারিয়েবলে এসাইন করা হয়েছে তাই এখানে আর সেটা দেখা যাচ্ছেনা। 

>>> last_name = input() #আরেকটি ভ্যারিয়েবলে নতুন একটি ইনপুট নেয়া হচ্ছে
islam                   #আমি islam লিখে এন্টার চাপলাম
>>>

>>> print(first_name)   #প্রিন্ট করে দেখি, কোন ভ্যারিয়েবলে কি ভ্যালু আছে! 
'rabiul'
>>> print(last_name)
'islam'

>>> print(first_name + last_name) #প্যারামিটর হিসেবে সিঙ্গেল ভ্যালু না দিয়ে এক্সপ্রেশন দেয়া হয়েছে!
'rabiulislam'                     #এবং ঠিক ভাবে কাজ করেছে... কারন মনে আছেতো?

>>> a = input() #আরেকট ইনপুট নেই
1               #এক লিখে এন্টার চাপলাম

>>> b = input() #আরো একটা ইনপুট
2               #দুই লিখলাম

>>> print(a) #প্রিন্ট করে দেখি
1
>>> print(b)
2

>>> print(a+b) # দুইটা যোগ করে প্রিন্ট করলে কত দেখাবে!??? 
12             # ওয়াও... একের সাথে দুই যোগ করলে বারো! 

>>> type(a)   #আচ্ছা টাইপ চেক করে দেখিতো
<class 'str'> #ও... input() ফাংশনতো সবসময় স্ট্রিং রিটার্ন করে! তাই আমার দেয়া 1 কেও সে '1' স্ট্রিং করে ফেলেছে!
>>> type(b)   #তাইতো বলি, ১ আর ২ মিলে বারো হয় কেন!! 
<class 'str'>
