>>> # আচ্ছা, * অপারেটরের একপাশে ইন্টেজার এবং আরেকপাশে স্ট্রিং থাকতে পারে, তাহলে নিশ্চয় একপাশে ইন্টেজার এবং
>>> # আরেকপাশে ফ্লোট নাম্বারও থাকতে পারবে! দেখিতো... 

>>> 3 * 4.0
12.0           # হুম, কাজ হয়, এবং রেজাল্টটাও ফ্লোট হিসেবেই আসে! আচ্ছা, একপাশে স্ট্রিং আরেকপাশে ইন্টেজার দিয়ে দেখিতো...

>>> "Hello " * 4
'Hello Hello Hello Hello '  # স্ট্রিংটা চার বার রিপিট হয়েছে! আচ্ছে, এবার একপাশে স্ট্রিং এবং আরেক পাশে ফ্লোট দিয়ে দেখি!

>>> "Hello " * 4.0          
Traceback (most recent call last):        # এরর হল! ঠিক আছে, তার মানে আর এভাবে কোড করা যাবেনা! 
  File "<stdin>", line 1, in <module>
TypeError: can't multiply sequence by non-int of type 'float'

>>> # আচ্ছা, একই লাইনে কি একাধিক এক্সপ্রেশন রান লিখা যায়!?
>>> int('23') + int(45.4) - float(3) #অনেকগুলো এক্সপ্রেশন লিখলাম
65.0                                 #এবং তা ঠিকভাবে কাজ করছে! 

>>> # সব টাইপের অবজেক্টকেইতো bool() ফাংশন দিয়ে বুলিয়ান ভ্যালুতে রূপান্তর করা যায়, আচ্ছা, বুলিয়ান ভ্যালু True আর False 
>>> # কে কিন অন্যান্য টাইপে কনভার্ট করা যায়!? দেখা দরকার! 
>>> int(True)  # True কে ইন্টেজারে কাস্ট করলাম
1              # এবং 1 পাওয়া গেল! 
>>> int(False) # False এর ইন্টেজার মান কি হতে পারে
0              # 0 হল!! 

>>> str(True)  # স্ট্রিং এ কাস্ট করলে কি হতে পারে? 
'True'         # জাস্ট কোটেশন দিয়ে দিলো! 
>>> str(False) # এটাও তো তাহলে কোটেশনই দিবে
'False'        # বলেছিলাম! 

>>> # + অপারেটর তো ইন্টেজার, ফ্লোট, স্ট্রিং সব টাইপেই কাজ করে, বুলিয়ানেও কি কোন কাজ করে? 
>>> True + True   # দেখি ট্রায় করে
2                 # দুই রিটার্ন করল! কেন!? 

>>> True + False  # আরো কিছু এক্সপ্রেশন দিয়ে দেখিতো... 
1
>>> True - True
0
>>> True - False
1
>>> False + False
0
>>> False + True
1
>>> False - False
0
>>> False - True 
-1

>>> # আচ্ছা আচ্ছা!! তার মানে হল, True টা আসলে 1 আর False টা হল গিয়ে 0
>>> # জানতাম নাতো!
