>>> print("Hello World!")  # আমরা print() ফাংশনের প্যারামিটার হিসেবে "Hello World" স্ট্রিং কে পাস করলাম
Hello World                # এবং print() ফাংশনটি সে স্ট্রিং টিকে মনিটরে (এখানে পরের লাইনেই) প্রিন্ট বা শো করল 

>>> greetings = "Welcome!" # "Welcome!" স্ট্রিং কে greetings ভ্যারিয়বলে রাখলাম, খেয়াল করুন
                           # ভ্যারিয়েবলের নামে কোন কোটেশন নেই, কিন্তু স্ট্রিং টি ডাবল কোটেশনে রাখা হয়েছে

>>> print(greetings)       # print() ফাংশনের প্যারামিটার হিসেবে greetings ভ্যারিয়েবল পাস করলাম
Welcome                    # এবং ফাংশনটি সে ভ্যারিয়েবলে থাকা ভ্যালু ('Welcome!') প্রিন্ট করল

                           # একটা কুইজ! আমরা যদি print(greetings) না লিখে print("greetings") লিখতাম তাহলে
                           # ফাংশনটি কি প্রিন্ট করত? কেন করত?
