>>> "Hello World"  # সাধারন স্ট্রিং! 
'Hello World'

>>> "Hello World".upper()  # স্ট্রিং এর পর একটা ডট (.) দিয়ে upper() মেথড লেখা হয়েছে। স্ট্রিং এর যেকোন মেথড এভাবেই লেখা হবে
'HELLO WORLD'              # upper() মেথড টি সে স্ট্রিং কে আপারকেস (Upper Case) হিসেবে রিটার্ন করে।  

>>> "Hello World".lower()  # স্ট্রিং কে লোআর (Lower Case) করতে চাইলে lower() মেথড ব্যবহার করা হয়, lower() এর আগের ডট (.) খেয়াল করুন 
'hello world'              # lower() মেথড স্ট্রিং কে ছোট হাতে অক্ষরে লিখে রিটার্ন করে।   

>>> "hello world".capitalize() # capitalize() মেথডটি যেকোন স্ট্রিং কে ক্যাপিটালাইজড করে রিটার্ন করে! 
'Hello world'                  # লক্ষ্য করুন, স্ট্রিং টি কিন্তু ছোট হাতের ছিল, এখন সেটা ক্যাপিটালাইজড হয়ে গেছে! 

>>> len("Hello World")     # কি মনে হয়!? এটাও কি একটা মেথড!? না, এটা জাস্ট একটা ফাংশন, len() ফাংশন, আমরা "Hello World"
11                         # স্ট্রিং কে len() ফাংশনের প্যারামিটার হিসেবে পাস করেছি, আর ফাংশনটি আমাদেরকে স্ট্রিং এর সাইজ বা লেংথ রিটার্ন করেছে
                           # গুনে দেখতে পারেন, "Hello World" স্ট্রিং টিতে ১১ টা অক্ষরই আছে... স্পেস (space) কেও হিসেবে ধরতে ভুলবেন না!

  >>> "Hello World!".upper() # upper() হল স্ট্রিং টাইপের অবজেক্টের মেথড, এটা যেকোন স্ট্রিং টাইপ অবজেক্টেই ব্যবহার করা যাবে 
'HELLO WORLD!'             # এবং এই মেথডটা সে স্ট্রিং কে বড় হাতের (Upper Case) করে রিটার্ন করবে


>>> 3.upper()    # .upper() মেথড ইন্টেজার টাইপের অবজেক্টে কাজ করবেনা, এরর দিবে!
File "<stdin>", line 1
    3.upper()
          ^
SyntaxError: invalid syntax
