>>> "Hello World!"  #ডাবল কোটেশনের ভিতর সাধারন একটি স্ট্রিং
'Hello World'

>>> type("Hello World!") #এর টাইপ চেক করলে স্ট্রিং (str) দেখতে পাব
<class 'str'>

>>> "Hello " + "World!" #স্ট্রিং কে আমরা যোগ করতে পারি, এক্ষেত্রে + অপারেটরের উভয় পাশের স্ট্রিং একত্রে যুক্ত হবে
'Hello World!

>>> "Hello " + "3"  # এখানে + এর উভয় অপারেন্ডই কিন্তু স্ট্রিং,  (তিন এর কোটেশন লক্ষ্য করুন) তাই এটাও যুক্ত হয়ে যাবে
'Hello 3'

>>> "Hello " + 3  # + অপারেটরের উভয় অপারেন্ট ইন্টেজার হতে পারে, আবার স্ট্রিংও হতে পারে, কিন্তু একটা অপারেন্ট স্ট্রিং এবং অন্যটা ইন্টেজার হতে পারবেনা
Traceback (most recent call last):   # ইন্টারপ্রেটারে ভুল দিলে সেটা এরর থ্রো করবে, এখানেও করেছে... 
  File "<stdin>", line 1, in <module>
TypeError: can't convert 'int' object to str implicitly 

>>> "Hello " * 3    # এখানে * অপারেটরের একপাশে স্ট্রিং এবং আরেকপাশে ইন্টেজার, এক্ষেত্রে ইন্টেজার দিয়ে স্ট্রিং মাল্টিপ্লাই হবে
'Hello Hello Hello' # অর্থাৎ স্ট্রিং টি ইন্টেজারের সমান বার একসাথে যোগ হবে, এক্ষেত্রে যেমন তিন বার যোগ হয়েছে! 

>>> "Hello " * "World!" # * অপারেটরের দুই পাশে স্ট্রিং হতে পারবেনা! এরর থ্রো করবে
Traceback (most recent call last):   # এই তিন লাইন হল এরর, এটা পড়ে বুঝার চেষ্টা করুন কি বলল !!!
  File "<stdin>", line 1, in <module>
TypeError: can't multiply sequence by non-int of type 'str'
