>>> bool(True)   # bool() একটা ফাংশন, bool হল ফাংশনের নাম এবং () এর ভিতরে যা দেয়া হয় সেগুলো হল ফাংশনের প্যারামিটার
True             # ফাংশন নিয়ে আমরা পরবর্তিতে  বিস্তারিত জানব, এখন শুধু এতটুকু জেনে রাখি যে bool() ফাংশনটি প্যারামিটার হিসেবে
                 # যেকোন টাইপের একটা ভ্যালু নেয় এবং সেটাকে বুলিয়ান টাইপে কনভার্ট করে আউটপুট রিটার্ন করে।
                 # এখানে ফাংশনটি প্যারামিটার হিসেবে True নিয়েছে, যেহেতু True নিজেই বুলিয়ান টাইপ ভ্যালু তাই bool() ফাংশনটি
                 # এটাকে আগের মত রেখেই রিটার্ন করেছে, কনভার্ট করার দরকার পরেনি।  

>>> bool(False)  # উপরের মতই, bool() এর ভিতর False ভ্যালু দেয়া হয়েছে, যেহেতু এটাও বুলিয়ান ভ্যালু তাই আউটপুট হিসেবে 
False            # False ই রিটার্ন হয়েছে

>>> bool(1)      # bool() এর ভিতরে প্যারামিটার হিসেবে ইন্টেজার ভ্যালু 1 দেয়া হয়েছে! bool() ফাংশনটি সেটাকে কনভার্ট করে বুলিয়ান ভ্যালু
True             # True করে রিটার্ন করেছে!     

>>> bool(254)    # হ্যা, সকল পজিটিভ (এবং নেগেটিভ) ইন্টেজার ভ্যালু বুলিয়ান ভ্যালুতে কনভার্ট করলে True হয়! এবং
True             # ইটস ট্রু    

>>> bool(0)      # একমাত্র জিরো (0) কে কনভার্ট করলে সেটা False হয়
False            # অর্থাৎ জিরোর বুলিয়ান ভ্যালু ফলস ! 

>>> bool(-1)     # আগেই বলেছি, সকল পজেটিভ এবং নেগেটিভ ইন্টেজারের বুলিয়ান ভ্যালু True হবে! 
True

>>> bool(5.2)    # ইন্টেজারের মত ফ্লোট টাইপের সকল পজেটিভ এবং নেগেটিভ নাম্বারকে বুলিয়ান ভ্যালুতে কনভার্ট করলে তা 
True             # অবশ্যই True হবে    

>>> bool(0.0)    # শুধুমাত্র জিরো পয়েন্ট জিরো (0.0) এর বুলিয়ান ভ্যালু False তাই এটাকে বুলিয়ানে কনভার্ট করলে 
False            # ফলস ই হবে     

>>> bool(0.1)    # এমনকি জিরো পয়ন্ট ওয়ান এরও বুলিয়ান ভ্যালু True
True

>>> bool(-2.0)   # নেগেটিভ ভ্যালু গুলোও ট্রু ! 
True

>>> bool("Hello")  # সকল স্ট্রিং এর বুলিয়ান ভ্যালু True হবে
True

>>> bool('World')  # স্ট্রিং ডাবল কোটেশন এর মধ্যে হোক বা সিঙ্গেল কোটেশন, ফলাফল একই থাকবে
True

>>> bool("")       # শুধুমাত্র এমটি (empty) স্ট্রিং (যেটাতে শুধু কোটেশন আছে কিন্তু কোটেশনের ভিতর কিছু নেই) সেটার বুলিয়ান ভ্যালু 
False              # ফলস হবে!    

>>> bool('')       # সিঙ্গেল কোট, ডাবল কোট ভাইভাই... 
False

>>> bool(" ")      # উপস... এটা কিন্তু এমটি স্ট্রিং না, কোটেশনের ভিতরের স্পেস (space) টা খেয়াল করেছেন !!? স্ট্রিং যত ছোট 
True               # যত বড়ই হোক, সেটাতে যাই থাকুক, এমনকি শুধুমাত্র একটা স্পেস তাকলেও সেটা ট্রু হবে!   

>>> bool(' ')      # স্পেস আছে কিন্তু ! 
True

>>> bool(5+3)      # মজার বিষয়, আমরা bool() ফাংশনে প্যারামিটার হিসেবে সিঙ্গেল ভ্যালুর পরিবর্তে এক্সপ্রেশন দিয়েছি, তারপরো এটা 
True               # কাজ করছে! বলতে পারবেন কেন!? আমরা কারনটা আগেই বর্ননা করেছি, পাইথন ইন্টারপ্রেটার সব সময় যেকোনো 
                   # এক্সপ্রেশনকে এভ্যালুয়েট করে একটা সিঙ্গেল ভ্যালু বের করে, অর্থাৎ যেকোন এক্সপ্রেশনকেই সে একটা সিঙ্গেল ভ্যালু 
                   # হিসেবে দেখে, এখানে ৫+৩ কেও এভ্যালুয়েট করে ৮ bool(8) হিসেবে দেখছে, আর আমরা তো জানিই যে, শুন্য বাদে
                   # সকল পজেটিভ এবং নেগেটিভ ইন্টেজারের বুলিয়ান ভ্যালু সর্বদা True হবে  

>>> bool(5-5)      # এখানে কি হল!? এক্সপ্রেশন এভ্যালুয়েট হয়ে ৫-৫ = ০ হল! আর bool(0) ফলস হবে সেটা তো জানা কথা !!! 
False
